In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

### 5.1 Pandas 자료구조

#### 5.1.1 Series
* __색인 index__ : 배열의 데이터와 연관된 이름  
    * 왼쪽 : 색인 - __index__
    * 오른쪽 : 값 - __values__

In [3]:
obj = pd.Series([4,7,-5,3])

obj   # 기본 색인: 정수 0 ~ (N-1)

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

색인 대입하여 변경

In [6]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

각 데이터 지칭하는 색인 지정

In [7]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])

obj2

d    4
b    7
a   -5
c    3
dtype: int64

값 선택 : 색인으로 라벨을 사용

In [8]:
obj2['a']

-5

In [9]:
obj2[['c','b','d']]  # 문자열을 색인의 배열로 해석

c    3
b    7
d    4
dtype: int64

불리언 배열 / NumPy 배열 연산 :색인 - 값 유지

In [10]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [11]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [12]:
import numpy as np

np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

* __Dictionary형__ 대체로 사용

In [13]:
'b' in obj2

True

In [14]:
'e' in obj2

False

Dictionary 객체로부터 Series 객체를 생성

In [15]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}

obj3 =  pd.Series(sdata)

obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [16]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

obj4 = pd.Series(sdata, index=states)  # 색인 직접 지정

obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

* __isnull, notnull__ : 누락된 데이터 찾을때 사용

In [17]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [18]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [19]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

* __산술 연산__ 에서 색인, 라벨 자동 정렬

In [20]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

* __name__ 속성

In [23]:
obj4.name = 'population'

obj4.index.name = 'state'

obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

#### 5.1.2 DataFrame
스프레드시트 형식의 자료구조  
- column : 서로 다른 종류의 값 담기 가능  
- row, column에 대한 색인 존재

In [24]:
# DataFrame 생성: 같은 길이의 list에 담김 dictionary 이용

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

In [25]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [27]:
# column 순서 지정

pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [28]:
# column 접근 - dictionary 형식 표기법

frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [29]:
# column 접근 - 속성 형식

frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [30]:
frame2 = pd.DataFrame(data, columns=['year','state','pop','debt'],
                      index=['one','two','three','four','five','six'])

frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

사전에 없는 값을 넘기면 결측치로 저장됨을 확인

In [31]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

* __loc__ : row의 이름을 이용해 해당 row에 접근

In [32]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

* column 대입 : DataFrame과 같은 크기의 리스트나 배열을 대입

In [33]:
# 스칼라값 대입

frame2['debt'] = 16.5

frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [34]:
# 배열 대입

frame2['debt'] = np.arange(6.)

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [35]:
# Series 대입

val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five']) 

frame2['debt'] = val  # 존재하지 않는 색인 = 결측치 대입

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [36]:
# 존재하지 않는 column 대입 = 새로운 column 생성

frame2['eastern'] = frame2.state =='Ohio'

frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

* __del__ : 칼럼 삭제
    * 데이터에 대한 복사가 아닌, 데이터 자체가 변경됨
    * 복사본 필요할땐?  copy 메소드 이용

In [37]:
del frame2['eastern']

frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

* 데이터 생성 - 중첩된 사전 이용
    * 바깥 키 = column
    * 안쪽 키 = row

In [38]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)

frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

* __T__ : 데이터 전치

In [39]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [40]:
# 색인 직접 지정

pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [41]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

* name 속성 지정하여 출력

In [42]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

* __values__ : 데이터를 2차원 배열로 반환

In [43]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [44]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

#### 5.1.4 색인 객체
* 표 형식의 데이터에서 각 row, column에 대한 이름 및 메타데이터 저장

In [45]:
obj = pd.Series(range(3), index=['a','b','c'])

index = obj.index

In [46]:
index

Index(['a', 'b', 'c'], dtype='object')

In [47]:
index[1:]

Index(['b', 'c'], dtype='object')

In [48]:
index[1]='d'   # 색인 객체는 변경 불가능 (TypeError)

TypeError: Index does not support mutable operations

* 중복된 인덱스 허용

In [49]:
dup_labels = pd.Index(['foo','foo','bar','foo'])

dup_labels

Index(['foo', 'foo', 'bar', 'foo'], dtype='object')

***
  
### 5.2 핵심기능
  
#### 5.2.1 reindex 재색인
* 새로운 색인에 맞도록 객체를 새로 생성

In [50]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d','b','a','c'])

obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [51]:
# reindex

obj2 = obj.reindex(['a','b','c','d','e'])

obj2   # 존재하지 않는 색인은 NaN

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

* __method__ :순차적 데이터 재색인 할때 값 보간
    * ffill : 누락값 = 직전값

In [52]:
obj3 = pd.Series(['blue','purple','yellow'], index=[0,2,4])

obj3

0      blue
2    purple
4    yellow
dtype: object

In [53]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

* row 재색인 ← 순서 전달
* column 재색인 ← columns 사용

In [54]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),
                     index=['a','c','d'],
                     columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [55]:
# row 재색인

frame2 = frame.reindex(['a','b','c','d'])

frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [56]:
# columns 재색인

states = ['Texas','Utah','California']

frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

* loc를 이용한 라벨 색인

In [57]:
frame.loc[['a','b','c','d'], states]

C:\Users\Admin\Anaconda3\lib\site-packages\pandas\core\indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

#### 5.2.2 하나의 row/columns 삭제
* __drop__ 메서드 사용 : drop한 값 제외된 결과 반환

In [58]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [59]:
new_obj = obj.drop('c')

new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [60]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [61]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [66]:
# 원본 객체 변경

obj.drop('c', inplace=True)

obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

row & column 모두에서 값 삭제

In [62]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['Ohio','Colorado','Utah','NewYork'],
                    columns=['one','two','three','four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [63]:
# delete row (axis=0) : drop([row 이름]) 

data.drop(['Colorado','Ohio'])

         one  two  three  four
Utah       8    9     10    11
NewYork   12   13     14    15

In [64]:
# delete column : axis=1 

data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
NewYork    12     14    15

In [65]:
# delete column : axis='columns' 

data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
NewYork    12     14

#### 5.2.4 색인, 선택, 거르기

* __색인하기__

In [67]:
obj = pd.Series(np.arange(4), index=['a','b','c','d'])

obj

a    0
b    1
c    2
d    3
dtype: int32

In [68]:
obj['b']

1

In [69]:
obj[1]

1

In [70]:
obj[2:4]

c    2
d    3
dtype: int32

In [71]:
obj[['b','a','d']]

b    1
a    0
d    3
dtype: int32

In [72]:
obj[[1,3]]

b    1
d    3
dtype: int32

In [73]:
obj[obj < 2]

a    0
b    1
dtype: int32

* __선택하기__
    * 슬라이싱: __라벨 이름__ 사용하면 시작점 & __끝점 포함!__

In [74]:
obj

a    0
b    1
c    2
d    3
dtype: int32

In [75]:
obj['b':'c']

b    1
c    2
dtype: int32

슬라이싱된 영역에 값 대입

In [76]:
obj['b':'c']=5

obj

a    0
b    5
c    5
d    3
dtype: int32

하나 이상의 column값 가져오기

In [77]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['Ohio', 'Colorado', 'Utah', 'NewYork'],
                    columns=['one','two','three','four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [78]:
# column 하나

data['two']

Ohio         1
Colorado     5
Utah         9
NewYork     13
Name: two, dtype: int32

In [80]:
# column 두개

data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
NewYork      14   12

슬라이싱 / 불리언 배열로 row 선택

In [81]:
# 슬라이싱

data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [83]:
# Boolian

data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

* __loc__과 __iloc__ 으로 선택: row에 대해 라벨로 색인하는 방법  
    * loc : 축이름 선택  
    * iloc : 정수 색인으로 선택

In [86]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [85]:
# 축의 라벨 이용

data.loc['Colorado', ['two', 'three']]  # 1 row, 2 columns 선택

two      5
three    6
Name: Colorado, dtype: int32

In [87]:
# iloc

data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [88]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [89]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [90]:
data.loc[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [91]:
data.iloc[:, :3][data.three >5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
NewYork    12   13     14

#### 5.2.4 정수 색인
: 라벨 = loc, 정수 색인 = iloc 을 사용하자!

In [92]:
# 정수 기반 색인

ser = pd.Series(np.arange(3.))

ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [93]:
ser[-1]  # 라벨 색인 찾기에 실패
         # 라벨 색인이 정수를 포함하면 라벨 색인/ 정수 색인 중 어떤 선택하는지 축측하기 어려움

KeyError: -1

In [94]:
# 정수기반 색인 사용하지 않았을때

ser2 = pd.Series(np.arange(3.), index = ['a','b','c'])

ser2[-1]

2.0

In [95]:
ser[:1]

0    0.0
dtype: float64

In [96]:
ser.loc[:1]  # 라벨 이름 사용하였으므로 index 1 까지 포함

0    0.0
1    1.0
dtype: float64

In [97]:
ser.iloc[:1] # 정수 색인 사용, index 1 포함 안함

0    0.0
dtype: float64

#### 5.2.5 산술 연산과 데이터 정렬
* 산술연산  
: 짝이 맞지 않는 색인이 있다면?  __결과에 두 색인 통합__  
: 서로 겹치는 색인 없는 데이터 값은 NA

In [98]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a','c','d','e'])

s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a','c','e','f','g'])

In [99]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [100]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [101]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

* 데이터 정렬  
: DataFrame - row, column 모두에 적용

In [103]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),
                   columns=list('bcd'),
                   index=['Ohio','Texas','Colorado'])

df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),
                   columns=list('bde'),
                   index=['Utah','Ohio','Texas','Oregon'])

In [104]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [105]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [107]:
# 색인과 column 합치기

df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

두 DataFrame 모두에 존재하지 않는 column의 값은 NaN

In [109]:
df1 = pd.DataFrame({'A': [1,2]})

df2 = pd.DataFrame({'B': [3,4]})

In [110]:
df1

   A
0  1
1  2

In [111]:
df2

   B
0  3
1  4

In [112]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

* 산술 연산 메소드 - 채워 넣을 값 지정  

서로 다른 색인을 가진 객체 간 연산에서 존재하지 않는 축의 값을 지정하고 싶을때:

In [116]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                   columns=list('abcd'))

df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                   columns=list('abcde'))
df2.loc[1, 'b'] = np.nan

In [117]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [118]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [119]:
df1 + df2  # 겹치지 않는 부분의 값: Na

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [121]:
# df1 - 메소드 : add
#     - 인자 : df2, fill_value

df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

재색인에 fill_value 이용

In [122]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

* DataFrame - Series 간의 연산

In [123]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

series = frame.iloc[0]

In [124]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [126]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [127]:
frame - series   # series 색인을 DataFrame column에 맞추고 아래 row로 전파

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

색인값을 DataFrame의 column과 Series의 색인에서 찾을 수 없을때? 재색인

In [130]:
series2 = pd.Series(np.arange(3), index=['b','e','f'])

series2

b    0
e    1
f    2
dtype: int32

In [131]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

각 row에 대한 연산 수행 : 산술 연산 메서드 이용  
→ axis=0, axis='index' : DataFrame의 row 따라 연산 수행

In [132]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [133]:
series3 = frame['d']

In [135]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [136]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

#### 5.2.6 함수 적용과 매핑
* __apply__ 메서드 : 각 column/row 의 1차원 배열에 함수 적용

In [141]:
frame = pd.DataFrame(np.random.randn(4,3),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

frame

               b         d         e
Utah   -0.356947  0.620558  0.216162
Ohio   -0.594298 -0.149450 -1.206852
Texas  -0.845066 -0.473786  0.296127
Oregon -0.589517  2.270929 -0.593568

In [142]:
np.abs(frame)

               b         d         e
Utah    0.356947  0.620558  0.216162
Ohio    0.594298  0.149450  1.206852
Texas   0.845066  0.473786  0.296127
Oregon  0.589517  2.270929  0.593568

In [143]:
# 각 column의 최대값-최소값 차이 계산
f = lambda x: x.max() - x.min()

frame.apply(f)

b    0.488119
d    2.744716
e    1.502980
dtype: float64

In [145]:
# 각 row에 대해 연산 수행

frame.apply(f, axis='columns')

Utah      0.977504
Ohio      1.057402
Texas     1.141193
Oregon    2.864497
dtype: float64

apply 메서드로 Series 반환

In [146]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f)

            b         d         e
min -0.845066 -0.473786 -1.206852
max -0.356947  2.270929  0.296127

* __applymap__ : 실수값을 문자열 포맷으로 변환

In [147]:
format = lambda x: '%.2f' % x

frame.applymap(format)

            b      d      e
Utah    -0.36   0.62   0.22
Ohio    -0.59  -0.15  -1.21
Texas   -0.85  -0.47   0.30
Oregon  -0.59   2.27  -0.59

* __map__ : Series의 각 원소에 함수 지정

In [148]:
frame['e'].map(format)

Utah       0.22
Ohio      -1.21
Texas      0.30
Oregon    -0.59
Name: e, dtype: object

#### 5.2.7 정렬과 순위
  
__정렬__
  
* __sort_index__ : 알파벳순 정렬. 정렬된 새로운 객체 반환

In [149]:
obj = pd.Series(range(4), index=['d','a','b','c'])

obj

d    0
a    1
b    2
c    3
dtype: int64

In [150]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

정렬 축 선택

In [151]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                     index = ['three', 'one'],
                     columns = ['d','a','b','c'])

frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [152]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [153]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

내림차순 정렬 (기본값: 오름차순)

In [154]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

* __sort_values__ : Series 객체를 값에 따라 정렬

In [155]:
obj = pd.Series([4,7,-3,2])

obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

비어있는 값은 가장 마지막에 위치

In [157]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

DataFrame에서 하나 이상의 column에 있는 값으로 정렬

In [158]:
frame = pd.DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]})

frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [159]:
# sort_values 의 by 옵션에 column 이름 추가

frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [160]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

__순위__  
: 배열의 유효한 데이터 개수까지만 순위 매김  
  
* __rank__ : 동점인 항목 = 평균 순위

In [161]:
obj = pd.Series([7,-5,7,4,2,0,4])

obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

데이터 상에서 나타나는 순서에 따른 순위 (같은 값이 앞 순서에 나타나면 더 높은 순위)

In [162]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

* 내림차순 순위

In [163]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

* row / column 에 대한 순위

In [164]:
frame = pd.DataFrame({'b':[4.3, 7, -3, 2],
                      'a':[0,1,0,1],
                      'c':[-2,5,8,-2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [165]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

#### 5.2.8 중복 색인
  
* is_unique : 해당 값이 유일한지 아닌지 판단

In [167]:
obj = pd.Series(range(5), index=['a','a','b','b','c'])

obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [168]:
obj.index.is_unique

False

중복 색인값 __없으면__: 색인 이용해 데이터 접근 - *스칼라값* 반환  
중복 색인값 __있으면__: 하나의 *Series* 객체 반환

In [170]:
obj['c']

4

In [169]:
obj['a']  # 중복 색인 존재

a    0
a    1
dtype: int64

* DataFrame에서 row 선택

In [171]:
df = pd.DataFrame(np.random.randn(4,3), index=['a', 'a', 'b', 'b'])

df

          0         1         2
a -0.988236  0.674514 -0.796996
a  0.349193 -1.650452 -0.781770
b -0.223944  0.071720  0.031707
b  0.695871  0.579360 -0.165923

In [172]:
df.loc['b']

          0        1         2
b -0.223944  0.07172  0.031707
b  0.695871  0.57936 -0.165923

### 5.3 기술 통계 계산과 요약

* 축소 / 요약통계

In [173]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                  index=['a','b','c','c'],
                  columns=['one','two'])

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
c  0.75 -1.3

In [174]:
# sum

df.sum()

one    9.25
two   -5.80
dtype: float64

In [175]:
# axis='columns' / axis=1

df.sum(axis=1)

a    1.40
b    2.60
c    0.00
c   -0.55
dtype: float64

In [176]:
# skipna option - NA 값 포함 여부

df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
c   -0.275
dtype: float64

In [177]:
# idxmin, idxmax - 최소값/최대값 가진 색인값 & 간접통계 반환

df.idxmax()

one    b
two    c
dtype: object

In [178]:
# accumulation 

df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
c  9.25 -5.8

In [179]:
# describe - 요약통계

df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [180]:
# 수치 데이터 아닐때 describe

obj = pd.Series(['a','a','b','c'] * 4)

obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

#### 5.3.1 상관관계, 공분산
* corr: NA가 아닌, 정렬된 색인에서 연속된 두 Series에 대한 상관관계
* cov : 공분산 계산

* corrwith : Series와 DataFrame의 상관관계 계산
    * corrwith('Series') : 각 column에 대해 계산한 상관관계를 담은 Series 반환
    * corrwith('DataFrame') : DF과 맞아떨어지는 column 이름에 대한 상관관계 계산 
  
  
* axis='columns' : 각 column에 대한 상관관계, 공분산 계산  
  
정렬 방식 : 상관관계 계산 전 색인 이름순 정렬

#### 5.3.2 유일값, 값 세기, 멤버십

In [181]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

* __unique__ : 중복값 제거후 유일값만 담고 있는 Series 반환

In [182]:
uniques = obj.unique()

uniques

array(['c', 'a', 'd', 'b'], dtype=object)

* __value_counts__ : Series 에서의 frequency 계산, 반환

In [183]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [184]:
# 오름차순 정렬  (기본값: 내림차순)

pd.value_counts(obj.values, sort = False)

a    3
c    3
b    2
d    1
dtype: int64

* __isin__ : 어떤 값이 Series에 존재하는지 Boolian 벡터 반환

In [185]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [187]:
mask = obj.isin(['b', 'c'])

mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

Series / DataFrame의 column에서 값을 골라내고 싶을때 사용

In [188]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

* Index.get_indexer : 여러 값이 있는 배열에서 유일한 값의 index 구함

In [189]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

unique_vals = pd.Series(['c', 'b', 'a'])

pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)